<?xml version="1.0"?>
<net name="runtime_gpu_graph" version="11">
	<layers>
		<layer id="0" name="image" type="Input">
			<data shape="1,3,480,640" element_type="u8" execOrder="0" execTimeMcs="0" originalLayersNames="image" outputLayouts="bfyx" outputPrecisions="u8" primitiveType="wait_for_events__u8" runtimePrecision="u8" />
			<output>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="depth" type="Input">
			<data shape="1,480,640,1" element_type="f32" execOrder="2" execTimeMcs="0" originalLayersNames="depth" outputLayouts="bfyx" outputPrecisions="f32" primitiveType="wait_for_events__f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>480</dim>
					<dim>640</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Convert_6598" type="Reorder">
			<data execOrder="1" execTimeMcs="1260" originalLayersNames="Convert_6598" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="reorder_data__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="__module.model.encoder/aten::upsample_bilinear2d/Interpolate" type="Resample">
			<data execOrder="448" execTimeMcs="105" originalLayersNames="__module.model.encoder/aten::upsample_bilinear2d/Interpolate,Multiply_25659,__module.model.encoder/aten::div/Divide" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="resample_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="__module.model.encoder.backbone.patch_embed.proj/aten::_convolution/Convolution" type="Convolution">
			<data execOrder="449" execTimeMcs="2731" originalLayersNames="__module.model.encoder.backbone.patch_embed.proj/aten::_convolution/Convolution,__module.model.encoder.backbone.patch_embed.proj/aten::_convolution/Add" outputLayouts="byxf" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.model.encoder.backbone.patch_embed/aten::transpose/Transpose_with_updated_order" type="Permute">
			<data execOrder="450" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.patch_embed/aten::transpose/Transpose_with_updated_order" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>40</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.model.encoder.backbone.patch_embed/aten::flatten/Reshape_sinked_after_transpose" type="Reshape">
			<data execOrder="451" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.patch_embed/aten::flatten/Reshape_sinked_after_transpose" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>40</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1200</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="__module.model.encoder/aten::add/Add_2" type="Eltwise">
			<data execOrder="452" execTimeMcs="1056" originalLayersNames="__module.model.encoder/aten::add/Add_2" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="eltwise_simple_vload8__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1200</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1200</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.model.encoder/aten::select/Gather" type="Reshape">
			<data execOrder="453" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder/aten::select/Gather" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1200</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1200</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Convert_16823" type="Reorder">
			<data execOrder="3" execTimeMcs="338" originalLayersNames="Convert_16823" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="reorder_data_fast_b1__f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>480</dim>
					<dim>640</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>480</dim>
					<dim>640</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="aten::unsqueeze/Unsqueeze" type="Reshape">
			<data execOrder="4" execTimeMcs="not_executed" originalLayersNames="aten::unsqueeze/Unsqueeze" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>480</dim>
					<dim>640</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="__module.model.encoder/aten::upsample_nearest2d/Interpolate" type="Resample">
			<data execOrder="5" execTimeMcs="11" originalLayersNames="__module.model.encoder/aten::upsample_nearest2d/Interpolate" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="resample_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="__module.model.encoder/aten::isinf/IsInf" type="Eltwise">
			<data execOrder="6" execTimeMcs="4" originalLayersNames="__module.model.encoder/aten::isinf/IsInf" outputLayouts="bfyx" outputPrecisions="u8" primitiveType="generic_eltwise_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="U8">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.model.encoder/aten::index_put_/Select" type="select">
			<data execOrder="117" execTimeMcs="9" originalLayersNames="__module.model.encoder/aten::index_put_/Select" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="select_gpu_ref__u8" runtimePrecision="u8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="__module.model.encoder/aten::isnan/IsNaN" type="Eltwise">
			<data execOrder="118" execTimeMcs="108" originalLayersNames="__module.model.encoder/aten::isnan/IsNaN" outputLayouts="bfyx" outputPrecisions="u8" primitiveType="generic_eltwise_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="U8">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.model.encoder/aten::index_put_/Select_1" type="select">
			<data execOrder="119" execTimeMcs="1348" originalLayersNames="__module.model.encoder/aten::index_put_/Select_1" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="select_gpu_ref__u8" runtimePrecision="u8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.model.encoder/aten::gt/Greater" type="Eltwise">
			<data execOrder="380" execTimeMcs="27" originalLayersNames="__module.model.encoder/aten::gt/Greater" outputLayouts="bfyx" outputPrecisions="u8" primitiveType="generic_eltwise_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="U8">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
				<port id="2" precision="U8">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="__module.model.encoder/aten::bitwise_not/BitwiseNot" type="Activation">
			<data execOrder="381" execTimeMcs="4" originalLayersNames="__module.model.encoder/aten::bitwise_not/BitwiseNot" outputLayouts="bfyx" outputPrecisions="u8" primitiveType="activation_opt__u8" runtimePrecision="u8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="U8">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="__module.model.encoder/aten::to/Convert_2" type="Reorder">
			<data execOrder="382" execTimeMcs="8" originalLayersNames="__module.model.encoder/aten::to/Convert_2" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="reorder_data__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="__module.model.encoder/aten::mul/Multiply_4" type="Eltwise">
			<data execOrder="383" execTimeMcs="17" originalLayersNames="__module.model.encoder/aten::mul/Multiply_4,__module.model.encoder/aten::log/Log" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="eltwise_simple_vload8__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="__module.model.encoder/aten::index_put_/Select_2" type="select">
			<data execOrder="384" execTimeMcs="326" originalLayersNames="__module.model.encoder/aten::index_put_/Select_2" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="select_gpu_ref__u8" runtimePrecision="u8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.model.encoder/aten::isfinite/IsFinite" type="Eltwise">
			<data execOrder="385" execTimeMcs="5" originalLayersNames="__module.model.encoder/aten::isfinite/IsFinite" outputLayouts="bfyx" outputPrecisions="u8" primitiveType="generic_eltwise_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="U8">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="__module.model.encoder/aten::where/Select" type="select">
			<data execOrder="386" execTimeMcs="13" originalLayersNames="__module.model.encoder/aten::where/Select" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="select_gpu_ref__u8" runtimePrecision="u8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="__module.model.encoder/aten::where/Select_0_reorder_0" type="Reorder">
			<data execOrder="387" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="byxf" outputPrecisions="f16" primitiveType="gpu:direct_copy__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="__module.model.encoder.backbone.depth_patch_embed.proj/aten::_convolution/Convolution" type="Convolution">
			<data execOrder="388" execTimeMcs="5291" originalLayersNames="__module.model.encoder.backbone.depth_patch_embed.proj/aten::_convolution/Convolution,__module.model.encoder.backbone.depth_patch_embed.proj/aten::_convolution/Add" outputLayouts="byxf" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>420</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.model.encoder.backbone.depth_patch_embed/aten::transpose/Transpose_with_updated_order" type="Permute">
			<data execOrder="389" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.depth_patch_embed/aten::transpose/Transpose_with_updated_order" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>30</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>40</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.model.encoder.backbone.depth_patch_embed/aten::flatten/Reshape_sinked_after_transpose" type="Reshape">
			<data execOrder="390" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.depth_patch_embed/aten::flatten/Reshape_sinked_after_transpose" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>40</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1200</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.model.encoder/aten::add/Add_4" type="Eltwise">
			<data execOrder="391" execTimeMcs="82" originalLayersNames="__module.model.encoder/aten::add/Add_4" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="eltwise_simple_vload8__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1200</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1200</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.model.encoder/aten::select/Gather_1" type="Reshape">
			<data execOrder="392" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder/aten::select/Gather_1" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1200</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1200</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.model.encoder/aten::cat/Concat" type="Concat">
			<data execOrder="454" execTimeMcs="650" originalLayersNames="__module.model.encoder/aten::cat/Concat" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="ocl:simple:reusable__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1200</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1200</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.model.encoder/aten::unsqueeze/Unsqueeze" type="Reshape">
			<data execOrder="455" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder/aten::unsqueeze/Unsqueeze" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="__module.model.encoder.backbone.blocks.0.norm1/aten::layer_norm/MVN" type="MVN">
			<data execOrder="456" execTimeMcs="690" originalLayersNames="__module.model.encoder.backbone.blocks.0.norm1/aten::layer_norm/MVN,__module.model.encoder.backbone.blocks.0.norm1/aten::layer_norm/Multiply_1,__module.model.encoder.backbone.blocks.0.norm1/aten::layer_norm/Add" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="mvn_gpu_bfyx_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.model.encoder.backbone.blocks.0.attn.qkv/aten::linear/MatMul" type="FullyConnected">
			<data execOrder="457" execTimeMcs="3376" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn.qkv/aten::linear/MatMul,__module.model.encoder.backbone.blocks.0.attn.qkv/aten::linear/Add" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="jit:gemm:any__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>3072</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.model.encoder.backbone.blocks.0.attn/aten::reshape/Reshape_reorder" type="Reorder">
			<data execOrder="458" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn/aten::reshape/Reshape" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>3072</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1</dim>
					<dim>3072</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.model.encoder.backbone.blocks.0.attn/aten::reshape/Reshape" type="Reshape">
			<data execOrder="459" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn/aten::reshape/Reshape" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1</dim>
					<dim>3072</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="__module.model.encoder.backbone.blocks.0.attn/aten::permute/Transpose" type="Permute">
			<data execOrder="460" execTimeMcs="2781" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn/aten::permute/Transpose" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="permute_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Split.out0" type="Crop">
			<data execOrder="467" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Split" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Squeeze_reorder" type="Reorder">
			<data execOrder="468" execTimeMcs="941" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Squeeze" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="reorder_data_fast_b1__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>38416</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Squeeze" type="Reshape">
			<data execOrder="469" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Squeeze" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>38416</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Split.out1" type="Crop">
			<data execOrder="464" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Split" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Squeeze_0_reorder" type="Reorder">
			<data execOrder="465" execTimeMcs="201" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Squeeze_0" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="reorder_data_fast_b1__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>38416</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Squeeze_0" type="Reshape">
			<data execOrder="466" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Squeeze_0" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>38416</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Split.out2" type="Crop">
			<data execOrder="461" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Split" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Squeeze_1_reorder" type="Reorder">
			<data execOrder="462" execTimeMcs="349" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Squeeze_1" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="reorder_data_fast_b1__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>38416</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Squeeze_1" type="Reshape">
			<data execOrder="463" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn/prim::ListUnpack/Squeeze_1" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>38416</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.model.encoder.backbone.blocks.0.attn/aten::scaled_dot_product_attention/ScaledDotProductAttention" type="scaled_dot_product_attention">
			<data execOrder="470" execTimeMcs="8821" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn/aten::scaled_dot_product_attention/ScaledDotProductAttention" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="ocl::sdpa::opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.model.encoder.backbone.blocks.0.attn/aten::permute/Transpose_1" type="Permute">
			<data execOrder="471" execTimeMcs="124" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn/aten::permute/Transpose_1" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="permute_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.model.encoder.backbone.blocks.0.attn/aten::reshape/Reshape_1" type="Reshape">
			<data execOrder="472" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.0.attn/aten::reshape/Reshape_1" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Multiply_59630" type="FullyConnected">
			<data execOrder="473" execTimeMcs="591" originalLayersNames="Multiply_59630,__module.model.encoder.backbone.blocks.0.ls1/aten::mul/Multiply,__module.model.encoder.backbone.blocks.0/aten::add/Add" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="jit:gemm:any__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="__module.model.encoder.backbone.blocks.0.norm2/aten::layer_norm/MVN" type="MVN">
			<data execOrder="474" execTimeMcs="83" originalLayersNames="__module.model.encoder.backbone.blocks.0.norm2/aten::layer_norm/MVN,__module.model.encoder.backbone.blocks.0.norm2/aten::layer_norm/Multiply_1,__module.model.encoder.backbone.blocks.0.norm2/aten::layer_norm/Add" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="mvn_gpu_bfyx_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.model.encoder.backbone.blocks.0.mlp.fc1/aten::linear/MatMul" type="FullyConnected">
			<data execOrder="475" execTimeMcs="7331" originalLayersNames="__module.model.encoder.backbone.blocks.0.mlp.fc1/aten::linear/MatMul,__module.model.encoder.backbone.blocks.0.mlp.fc1/aten::linear/Add,__module.model.encoder.backbone.blocks.0.mlp.act/aten::gelu/Gelu" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="jit:gemm:any__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>4096</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Multiply_59634" type="FullyConnected">
			<data execOrder="476" execTimeMcs="6576" originalLayersNames="Multiply_59634,__module.model.encoder.backbone.blocks.0.ls2/aten::mul/Multiply,__module.model.encoder.backbone.blocks.0/aten::add/Add_1" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="jit:gemm:any__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>4096</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.model.encoder.backbone.blocks.1.norm1/aten::layer_norm/MVN" type="MVN">
			<data execOrder="477" execTimeMcs="1421" originalLayersNames="__module.model.encoder.backbone.blocks.1.norm1/aten::layer_norm/MVN,__module.model.encoder.backbone.blocks.1.norm1/aten::layer_norm/Multiply_1,__module.model.encoder.backbone.blocks.1.norm1/aten::layer_norm/Add" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="mvn_gpu_bfyx_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.model.encoder.backbone.blocks.1.attn.qkv/aten::linear/MatMul" type="FullyConnected">
			<data execOrder="478" execTimeMcs="7628" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn.qkv/aten::linear/MatMul,__module.model.encoder.backbone.blocks.1.attn.qkv/aten::linear/Add" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="jit:gemm:any__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>3072</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="__module.model.encoder.backbone.blocks.1.attn/aten::reshape/Reshape_reorder" type="Reorder">
			<data execOrder="479" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn/aten::reshape/Reshape" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>3072</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1</dim>
					<dim>3072</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="__module.model.encoder.backbone.blocks.1.attn/aten::reshape/Reshape" type="Reshape">
			<data execOrder="480" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn/aten::reshape/Reshape" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1</dim>
					<dim>3072</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.model.encoder.backbone.blocks.1.attn/aten::permute/Transpose" type="Permute">
			<data execOrder="481" execTimeMcs="518" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn/aten::permute/Transpose" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="permute_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Split.out0" type="Crop">
			<data execOrder="488" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Split" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Squeeze_reorder" type="Reorder">
			<data execOrder="489" execTimeMcs="151" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Squeeze" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="reorder_data_fast_b1__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>38416</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Squeeze" type="Reshape">
			<data execOrder="490" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Squeeze" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>38416</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Split.out1" type="Crop">
			<data execOrder="485" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Split" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Squeeze_0_reorder" type="Reorder">
			<data execOrder="486" execTimeMcs="132" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Squeeze_0" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="reorder_data_fast_b1__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>38416</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Squeeze_0" type="Reshape">
			<data execOrder="487" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Squeeze_0" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>38416</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Split.out2" type="Crop">
			<data execOrder="482" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Split" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Squeeze_1_reorder" type="Reorder">
			<data execOrder="483" execTimeMcs="417" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Squeeze_1" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="reorder_data_fast_b1__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>38416</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Squeeze_1" type="Reshape">
			<data execOrder="484" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn/prim::ListUnpack/Squeeze_1" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>38416</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="__module.model.encoder.backbone.blocks.1.attn/aten::scaled_dot_product_attention/ScaledDotProductAttention" type="scaled_dot_product_attention">
			<data execOrder="491" execTimeMcs="8312" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn/aten::scaled_dot_product_attention/ScaledDotProductAttention" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="ocl::sdpa::opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.model.encoder.backbone.blocks.1.attn/aten::permute/Transpose_1" type="Permute">
			<data execOrder="492" execTimeMcs="104" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn/aten::permute/Transpose_1" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="permute_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2401</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.model.encoder.backbone.blocks.1.attn/aten::reshape/Reshape_1" type="Reshape">
			<data execOrder="493" execTimeMcs="not_executed" originalLayersNames="__module.model.encoder.backbone.blocks.1.attn/aten::reshape/Reshape_1" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Multiply_59638" type="FullyConnected">
			<data execOrder="494" execTimeMcs="327" originalLayersNames="Multiply_59638,__module.model.encoder.backbone.blocks.1.ls1/aten::mul/Multiply,__module.model.encoder.backbone.blocks.1/aten::add/Add" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="jit:gemm:any__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>2401</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.model.encoder.backbone.blocks.1.norm2/aten::layer_norm/MVN" type="MVN">
